/*
Данная глава описывает механизм работы вкладки "Главная" - Navigation Bar. Принцип работы состоит в следующем:
Данная глава включает в себя следующие контроллеры:
ViewController1 - первый уровень - смотреть Darkside только! Остальные табаки не отработаны в json.
ViewController2 - второй уровень
ViewController3 - третий уровень
ViewController31 - реализует комментарии табака
ViewCOntroller32 - отзывы
TableViewCell1 - реализованы методы делегата кнопок и TableViewCell всех вышеперечисленных контроллеров
CollectionViewCell1 - реализует скролл граммовки и цен табака во ViewController3
 TableView1 - реализует параллакс эффект
*/
