/*
Данная глава описывает механизм работы вкладки "Корзина" - Navigation Bar. Принцип работы состоит в следующем:
Данная глава включает в себя следующие контроллеры:
ViewController5 - реализует корзину со скрытием imageview при неравенстве нулю кордаты наименования табака в корзине
ViewController51 - подтверждение 1
ViewController52 -подтверждение 2
ViewController53 -подтверждение 3
ViewCOntroller54 - подтверждение 4 с обновлением массивов глобальных переменных и CoreData, которые относятся к корзине
ViewCOntroller55 - финальное подтверждение с последующим перехожом на ViewController5
TableViewCell3 - реализует методы делегата и реализации tableviewcell контроллеров, представленных выше
*/

