/*
Данная глава описывает механизм работы вкладки "Профиль" - Navigation Bar. Принцип работы состоит в следующем:
Данная глава включает в себя следующие контроллеры:
ViewController4 - контроллер главного окна Профиля с загрузкой данных из CoreData
ViewController41 -   настройки
ViewController42 -  лайки
ViewController43 - история
ViewCOntroller44 - лояльность (пока нет функционала)
ViewCOntroller45 - поддержка (пока нет функционала)
TableViewCell2 - реализует методы делегата и реализации tableviewcell контроллеров, представленных выше
*/
